## SQL VS Pandas

- data cleaning 
- exploring data
- analyze the data

In [95]:
import pandas as pd 
from skimpy import clean_columns

In [96]:
d={
    'name':['raed','jason','kansana','mike','ahmed','christin'],

'country':['egybt','uk','india','usa','egypt','uk'],
'Job':
['data scientist','data analyst','data scientist','data engneer',
'software engneer','data analyst']



,'age':[22,34,33,23,25,30]


}

In [97]:

dd={
'name':['raed','jason','kansana','mike','ahmed','christin'],
'Grad': [20210520,20060516,20090903,20190904,20190906,20110906]

}

In [98]:
df2=pd.DataFrame(dd)
df2

       name      Grad
0      raed  20210520
1     jason  20060516
2   kansana  20090903
3      mike  20190904
4     ahmed  20190906
5  christin  20110906

In [193]:
df=pd.DataFrame(d)
df

       name country               Job  age
0      raed   egybt    data scientist   22
1     jason      uk      data analyst   34
2   kansana   india    data scientist   33
3      mike     usa      data engneer   23
4     ahmed   egypt  software engneer   25
5  christin      uk      data analyst   30

### Cleaning

-----

1-Data quality checks

In [100]:
df.dtypes

name       object
country    object
Job        object
age         int64
dtype: object

In [101]:
df2.dtypes

name    object
Grad     int64
dtype: object

In [202]:
df['country'].value_counts()

uk       2
egybt    1
india    1
usa      1
egypt    1
Name: country, dtype: int64

In [194]:
# is null 
df.isna().any()

name       False
country    False
Job        False
age        False
dtype: bool

In [ ]:
#if rows are empty. I can drop them through the dropna() function:
#df.dropna(inplace=True, axis=0)

In [198]:
df['Job'].duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
Name: Job, dtype: bool

In [199]:
df['Job']

0      data scientist
1        data analyst
2      data scientist
3        data engneer
4    software engneer
5        data analyst
Name: Job, dtype: object

In [ ]:
#DataFrame_name.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)

The Pandas object datatype can be mixed types, with string and numeric data, but Pandas will treat it as a string.

Joining Dataframes

In [102]:
df_all_rows =  pd.merge(df, df2, how='inner', on = 'name')
df_all_rows

       name country               Job  age      Grad
0      raed   egybt    data scientist   22  20210520
1     jason      uk      data analyst   34  20060516
2   kansana   india    data scientist   33  20090903
3      mike     usa      data engneer   23  20190904
4     ahmed   egypt  software engneer   25  20190906
5  christin      uk      data analyst   30  20110906

In [103]:
clean_df = clean_columns(df_all_rows, case = 'pascal')

3 column names have been cleaned

In [104]:
clean_df

       Name Country               Job  Age      Grad
0      raed   egybt    data scientist   22  20210520
1     jason      uk      data analyst   34  20060516
2   kansana   india    data scientist   33  20090903
3      mike     usa      data engneer   23  20190904
4     ahmed   egypt  software engneer   25  20190906
5  christin      uk      data analyst   30  20110906

In [105]:
clean_df2 = clean_columns(clean_df, case = 'pascal', replace = {'job':'Occupation','Grad':'GraduationDate'})

2 column names have been cleaned

In [106]:
clean_df2

       Name Country        Occupation  Age  GraduationDate
0      raed   egybt    data scientist   22        20210520
1     jason      uk      data analyst   34        20060516
2   kansana   india    data scientist   33        20090903
3      mike     usa      data engneer   23        20190904
4     ahmed   egypt  software engneer   25        20190906
5  christin      uk      data analyst   30        20110906

formatting and Data standardization

In [114]:
list=clean_df2['GraduationDate'].tolist()

In [115]:
list

[20210520, 20060516, 20090903, 20190904, 20190906, 20110906]

In [124]:
date = pd.to_datetime(pd.Series(list))
change_format = date.dt.strftime('%d-%m-%Y')
print(change_format)

0    01-01-1970
1    01-01-1970
2    01-01-1970
3    01-01-1970
4    01-01-1970
5    01-01-1970
dtype: object

To solve this problem, you must make the data type text and not numeric

In [118]:
data=clean_df2['GraduationDate']

In [125]:
str_data=data.astype(str)

In [130]:
list=str_data.to_list()

In [131]:
list

['20210520', '20060516', '20090903', '20190904', '20190906', '20110906']

In [132]:
str_date = pd.to_datetime(pd.Series(list))
change_format = str_date.dt.strftime('%d-%m-%Y')
print(change_format)

0    20-05-2021
1    16-05-2006
2    03-09-2009
3    04-09-2019
4    06-09-2019
5    06-09-2011
dtype: object

In [137]:
df=pd.DataFrame(change_format,columns=['GraduationDate'])

In [145]:
df

  GraduationDate
0     20-05-2021
1     16-05-2006
2     03-09-2009
3     04-09-2019
4     06-09-2019
5     06-09-2011

In [143]:
clean_df2

       Name Country        Occupation  Age  GraduationDate
0      raed   egybt    data scientist   22        20210520
1     jason      uk      data analyst   34        20060516
2   kansana   india    data scientist   33        20090903
3      mike     usa      data engneer   23        20190904
4     ahmed   egypt  software engneer   25        20190906
5  christin      uk      data analyst   30        20110906

In [148]:
clean_df2.insert(1,'graduationDate',df)

In [ ]:
#del clean_df2['GraduationDate']

In [152]:

clean_df2

       Name graduationDate Country        Occupation  Age
0      raed     20-05-2021   egybt    data scientist   22
1     jason     16-05-2006      uk      data analyst   34
2   kansana     03-09-2009   india    data scientist   33
3      mike     04-09-2019     usa      data engneer   23
4     ahmed     06-09-2019   egypt  software engneer   25
5  christin     06-09-2011      uk      data analyst   30

In [158]:
df[['D','m','GraduationYear']] = clean_df2.graduationDate.str.split('-', expand=True)

In [160]:
df=df['GraduationYear']
df

0    2021
1    2006
2    2009
3    2019
4    2019
5    2011
Name: GraduationYear, dtype: object

In [161]:
clean_df2.insert(1,'GraduationYear',df)

In [162]:
clean_df2

       Name GraduationYear graduationDate Country        Occupation  Age
0      raed           2021     20-05-2021   egybt    data scientist   22
1     jason           2006     16-05-2006      uk      data analyst   34
2   kansana           2009     03-09-2009   india    data scientist   33
3      mike           2019     04-09-2019     usa      data engneer   23
4     ahmed           2019     06-09-2019   egypt  software engneer   25
5  christin           2011     06-09-2011      uk      data analyst   30

In [163]:
del clean_df2['graduationDate']

In [164]:
clean_df2

       Name GraduationYear Country        Occupation  Age
0      raed           2021   egybt    data scientist   22
1     jason           2006      uk      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     usa      data engneer   23
4     ahmed           2019   egypt  software engneer   25
5  christin           2011      uk      data analyst   30

In [166]:
for x in clean_df2.index:
  if clean_df2.loc[x, "Country"]=='uk':
    clean_df2.loc[x, "Country"] = 'UK'

In [167]:
clean_df2

       Name GraduationYear Country        Occupation  Age
0      raed           2021   egybt    data scientist   22
1     jason           2006      UK      data analyst   34
2   kansana           2009   india    data scientist   33
3      mike           2019     usa      data engneer   23
4     ahmed           2019   egypt  software engneer   25
5  christin           2011      UK      data analyst   30

In [172]:
for x in clean_df2.index:
  if clean_df2.loc[x, "Country"]=='egybt':
    clean_df2.loc[x, "Country"] = 'Egypt'

  elif clean_df2.loc[x, "Country"]=='usa':
     clean_df2.loc[x, "Country"] = 'USA'

senario2

In [180]:
clean_df2

       Name country GraduationYear        Occupation  Age
0      raed   egybt           2021    data scientist   22
1     jason      uk           2006      data analyst   34
2   kansana   india           2009    data scientist   33
3      mike     usa           2019      data engneer   23
4     ahmed   egypt           2019  software engneer   25
5  christin      uk           2011      data analyst   30

In [185]:
cleand_df3=clean_df2.replace(['egybt','egypt'],'Egypt')

In [187]:
cleand_df3

       Name country GraduationYear        Occupation  Age
0      raed   Egypt           2021    data scientist   22
1     jason      uk           2006      data analyst   34
2   kansana   india           2009    data scientist   33
3      mike     usa           2019      data engneer   23
4     ahmed   Egypt           2019  software engneer   25
5  christin      uk           2011      data analyst   30

In [188]:
df4=cleand_df3.replace('usa','USA')

In [189]:
df4

       Name country GraduationYear        Occupation  Age
0      raed   Egypt           2021    data scientist   22
1     jason      uk           2006      data analyst   34
2   kansana   india           2009    data scientist   33
3      mike     USA           2019      data engneer   23
4     ahmed   Egypt           2019  software engneer   25
5  christin      uk           2011      data analyst   30

In [190]:
df_cleand=df4.replace('uk','UK')

In [191]:
df_cleand

       Name country GraduationYear        Occupation  Age
0      raed   Egypt           2021    data scientist   22
1     jason      UK           2006      data analyst   34
2   kansana   india           2009    data scientist   33
3      mike     USA           2019      data engneer   23
4     ahmed   Egypt           2019  software engneer   25
5  christin      UK           2011      data analyst   30

-------

### Exploratory data analysis

In [203]:
from pandas_profiling import ProfileReport

In [204]:
profile = ProfileReport(df_cleand)

The library builds an HTML file, which contains all the statistics for each column, as well as calculates the correlations between each pair of numeric columns. The following figure shows an example of the produced report:

In [ ]:
#profile.to_file("rainfall.html") or

In [1]:
#profile.to_notebook_iframe()

-----

### analyze the data

In [206]:
df_cleand

       Name country GraduationYear        Occupation  Age
0      raed   Egypt           2021    data scientist   22
1     jason      UK           2006      data analyst   34
2   kansana   india           2009    data scientist   33
3      mike     USA           2019      data engneer   23
4     ahmed   Egypt           2019  software engneer   25
5  christin      UK           2011      data analyst   30

let's select all Egyptian students

In [207]:
df_cleand[df_cleand['country']=='Egypt']

    Name country GraduationYear        Occupation  Age
0   raed   Egypt           2021    data scientist   22
4  ahmed   Egypt           2019  software engneer   25

selecting all names which start with M' letter

In [209]:
df_cleand[df_cleand['Name'].str.startswith('m')]

   Name country GraduationYear    Occupation  Age
3  mike     USA           2019  data engneer   23

finding the pepole whose ages are between 20 and 30 years old

In [210]:
df_cleand[ (df_cleand['Age']>=20)  &  (df_cleand['Age']<=30) ]

       Name country GraduationYear        Occupation  Age
0      raed   Egypt           2021    data scientist   22
3      mike     USA           2019      data engneer   23
4     ahmed   Egypt           2019  software engneer   25
5  christin      UK           2011      data analyst   30

finding the pepole whose job is data scientist or data analyst

In [228]:
df_cleand[(df_cleand.Occupation == 'data scientist') | (df_cleand.Occupation == 'data analyst') ]

       Name country GraduationYear      Occupation  Age
0      raed   Egypt           2021  data scientist   22
1     jason      UK           2006    data analyst   34
2   kansana   india           2009  data scientist   33
5  christin      UK           2011    data analyst   30

finding the pepole whose job is data engneer or softwar engneer

In [231]:
df_cleand[(df_cleand.Occupation != 'data scientist') & (df_cleand.Occupation != 'data analyst') ]

    Name country GraduationYear        Occupation  Age
3   mike     USA           2019      data engneer   23
4  ahmed   Egypt           2019  software engneer   25

Rank employees based on their age in descending order

In [238]:
df_cleand.sort_values(by=['Age'], ascending=False)

       Name country GraduationYear        Occupation  Age
1     jason      UK           2006      data analyst   34
2   kansana   india           2009    data scientist   33
5  christin      UK           2011      data analyst   30
4     ahmed   Egypt           2019  software engneer   25
3      mike     USA           2019      data engneer   23
0      raed   Egypt           2021    data scientist   22